# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растет на круглой грядке, причем кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, 
# находясь перед некоторым кустом заданной во входном файле грядки.

N = int(input("Введите кол-во кустов "))
n = list()
for i in range(1, N+1):
    x = int(input(f"Введите кол-во ягод на {i} кусте "))
    n.append(x)
res = 0
arr = []
for i in range(len(n)-1):
    res = n[i-1] + n[i] + n[i + 1]    
    arr.append(res)
arr.append(n[0]+n[-1]+n[-2])

print(max(arr))
