# *Задача 20: * В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. 
# В случае с английским алфавитом очки распределяются так:A, E, I, O, U, L, N, S, T, R – 1 очко; 
# D, G – 2 очка; 
# B, C, M, P – 3 очка; 
# F, H, V, W, Y – 4 очка; 
# K – 5 очков; 
# J, X – 8 очков; 
# Q, Z – 10 очков. 
# А русские буквы оцениваются так: А, В, Е, И, Н, О, Р, С, Т – 1 очко; 
# Д, К, Л, М, П, У – 2 очка; 
# Б, Г, Ё, Ь, Я – 3 очка; 
# Й, Ы – 4 очка; 
# Ж, З, Х, Ц, Ч – 5 очков; 
# Ш, Э, Ю – 8 очков; 
# Ф, Щ, Ъ – 10 очков. 
# Напишите программу, которая вычисляет стоимость введенного пользователем слова. 
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.
# *Пример:*
# ноутбук
#     12

words = ["A", "E", "I", "O", "U", "L", "N", "S", "T", "R", "А", "В", "Е", "И", "Н", "О", "Р", "С", "Т"]
words2 = ["D", "G", "Д", "К", "Л", "М", "П", "У"]
words3 = ["B", "C", "M", "P", "Б", "Г", "Ё", "Ь", "Я"]
words4 = ["F", "H", "V", "W", "Y", "Й", "Ы"]
words5 = ["K", "Ж", "З", "Х", "Ц", "Ч"]
words8 = ["J", "X", "Ш", "Э", "Ю"]
words10 = ["Q", "Z", "Ф", "Щ", "Ъ"]

word = input("Введите слово ").upper()
print(word)
sum = 0
for i in range(len(word)):
    if word[i] in words:
        sum +=1
    elif word[i] in words2:
        sum +=2
    elif word[i] in words3:
        sum +=3
    elif word[i] in words4:
        sum +=4    
    elif word[i] in words5:
        sum +=5
    elif word[i] in words8:
        sum +=8
    elif word[i] in words10:
        sum +=10
print(sum)  